package ch05;

public class Exercise5 {
       /*   
                    

                      5. 배열의 기본 초기값에 대한 설명으로 틀린 것은 무엇입니까?

                         정수 타입 배열 항목의 기본 추기값은 0이다.
                         실수 타입 배열 항목의 기본 초기값은 0.0f 또는 0.0이다.
                         boolean 타입 배열 항목의 기본 초기값은 true이다. ->답
                         참조 타입 배열 항목의 기본 초기값은 null이다.
                       
                       설명:  boolean 타입 배열의 초기값: false

                                                                                                     */                                           


}
